[Killed] BlockStatement
main/components/Modal/ReviewModeratorModal.jsx:8:31
   // Stryker disable next-line StringLiteral
   const [moderatorComment, setModeratorComment] = useState("");
 
-  const handleSubmit = (e) => {
-    e.preventDefault();
-    if (status === "APPROVED" || status === "REJECTED") {
-      onSubmit({ status, moderatorComment });
-    }
-    onClose();
-  };
+  const handleSubmit = (e) => {};
 
   const handleClose = () => {
killedBy: ReviewModeratorModal tests calls onSubmit with status APPROVED and moderatorComment; ReviewsTable tests handleSubmit sends correct payload for approve
statusReason: expected "vi.fn()" to be called with arguments: [ { status: 'APPROVED', …(1) } ]

Number of calls: 0

[Killed] EqualityOperator
main/components/Modal/ReviewModeratorModal.jsx:10:9
 
   const handleSubmit = (e) => {
     e.preventDefault();
-    if (status === "APPROVED" || status === "REJECTED") {
+    if (status !== "APPROVED" || status === "REJECTED") {
       onSubmit({ status, moderatorComment });
     }
killedBy: ReviewModeratorModal tests calls onSubmit with status APPROVED and moderatorComment
statusReason: expected "vi.fn()" to be called with arguments: [ { status: 'APPROVED', …(1) } ]

Number of calls: 0

[Killed] BlockStatement
main/components/Modal/ReviewModeratorModal.jsx:16:29
     onClose();
   };
 
-  const handleClose = () => {
-    setModeratorComment("");
-    onClose();
-  };
+  const handleClose = () => {};
 
   const isApproved = status === "APPROVED";
killedBy: ReviewModeratorModal tests cancel button calls onClose
statusReason: expected "vi.fn()" to be called 1 times, but got 0 times

[Killed] StringLiteral
main/components/Modal/ReviewModeratorModal.jsx:17:25
   };
 
   const handleClose = () => {
-    setModeratorComment("");
+    setModeratorComment("Stryker was here!");
     onClose();
   };
killedBy: ReviewsTable tests textarea is empty when modal is reopened after cancel
statusReason: expect(element).toHaveValue()

Expected the element to have value:

Received:
  Stryker was here!

[Killed] ConditionalExpression
main/components/Modal/ReviewModeratorModal.jsx:21:22
     onClose();
   };
 
-  const isApproved = status === "APPROVED";
+  const isApproved = false;
 
   if (!isOpen) {
killedBy: ReviewModeratorModal tests submit button says Approve when status is APPROVED
statusReason: expect(element).toHaveTextContent()

Expected element to have text content:
  Approve
Received:
  Reject
