[Killed] ConditionalExpression
main/pages/Admin/ModeratorsCreatePage.jsx:19:9
 
   const onSuccess = (moderator) => {
     toast(`New moderator added - email: ${moderator.email}`);
-    if (!storybook) navigation("/admin/moderators");
+    if (false) navigation("/admin/moderators");
   };
 
killedBy: ModeratorsCreatePage tests on submit, makes request to backend, and redirects to /admin/moderators
statusReason: expected "vi.fn()" to be called with arguments: [ '/admin/moderators' ]

Number of calls: 0


Ignored nodes: comments, script, style
<html>
  <head />
