[Killed] StringLiteral
src/main/components/OurTable.jsx:27:61
               >
                 {column.render("Header")}
                 <span data-testid={`${testid}-header-${column.id}-sort-carets`}>
-                  {column.isSorted ? (column.isSortedDesc ? " 🔽" : " 🔼") : ""}
+                  {column.isSorted ? (column.isSortedDesc ? "": " 🔼") : ""}
                 </span>
               </th>
killedBy: OurTable tests click on a header and a sort caret should appear
statusReason: Unable to find an element with the text: 🔽. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div>
    <table
      class="table table-striped table-bordered table-hover"
      role="table"
