[Killed] BlockStatement
main/components/Reviews/ReviewsTable.jsx:73:50
     setShow(true);
   };
 
-  const handleSubmit = ({ moderatorComment }) => {
-    if (pendingStatus === "APPROVED") {
-      approveMutation.mutate({
-        cell: pendingCell,
-        moderatorComments: moderatorComment,
-      });
-    } else {
-      rejectMutation.mutate({
-        cell: pendingCell,
-        moderatorComments: moderatorComment,
-      });
-    }
-    handleClose();
-  };
+  const handleSubmit = ({ moderatorComment }) => {};
 
   const columns = [
killedBy: ReviewsTable tests handleSubmit sends correct payload for approve
statusReason: expected +0 to be 1 // Object.is equality

Ignored nodes: comments, script, style
<html>
  <head />
  <body
    class=""
    style=""

[Killed] EqualityOperator
main/components/Reviews/ReviewsTable.jsx:74:9
   };
 
   const handleSubmit = ({ moderatorComment }) => {
-    if (pendingStatus === "APPROVED") {
+    if (pendingStatus !== "APPROVED") {
       approveMutation.mutate({
         cell: pendingCell,
killedBy: ReviewsTable tests handleSubmit sends correct payload for approve
statusReason: expected { id: 1, status: 'REJECTED', …(1) } to match object { status: 'APPROVED', …(1) }
(1 matching property omitted from actual)

Ignored nodes: comments, script, style
<html>
  <head />
  <body
    class=""

[Killed] BlockStatement
main/components/Reviews/ReviewsTable.jsx:79:12
         cell: pendingCell,
         moderatorComments: moderatorComment,
       });
-    } else {
-      rejectMutation.mutate({
-        cell: pendingCell,
-        moderatorComments: moderatorComment,
-      });
-    }
+    } else {}
     handleClose();
   };
killedBy: ReviewsTable tests handleSubmit sends correct payload for reject
statusReason: expected +0 to be 1 // Object.is equality

Ignored nodes: comments, script, style
<html>
  <head />
  <body
    class=""
    style=""

[Killed] ObjectLiteral
main/components/Reviews/ReviewsTable.jsx:99:5
       accessor: "moderatorComments",
       Cell: ({ value }) => value,
     },
-    {
-      Header: "Item Id",
-      accessor: "item.id",
-    },
+    {},
     {
       Header: "Item Name",
killedBy: ModerateReviews Page Tests renders reviews with approve/reject buttons for moderator; ReviewsTable tests Has the base column headers and content
statusReason: A column ID (or string accessor) is required!

[Killed] StringLiteral
main/components/Reviews/ReviewsTable.jsx:110:28
     {
       Header: "Score",
       accessor: "itemsStars",
-      Cell: ({ value }) => "⭐".repeat(value),
+      Cell: ({ value }) => "".repeat(value),
     },
     {
killedBy: ReviewsTable tests Renders stars icons and formatted date correctly
statusReason: expect(element).toHaveTextContent()

Expected element to have text content:
  ⭐⭐⭐⭐
Received:
