[Killed] BooleanLiteral
main/pages/Admin/ModeratorsCreatePage.jsx:7:60
 import { useBackendMutation } from "main/utils/useBackend";
 import { toast } from "react-toastify";
 
-export default function ModeratorsCreatePage({ storybook = false }) {
+export default function ModeratorsCreatePage({ storybook = true }) {
   const navigation = useNavigate();
   const objectToAxiosParams = (moderator) => ({
killedBy: ModeratorsCreatePage tests on submit, makes request to backend, and redirects to /admin/moderators
statusReason: expected "vi.fn()" to be called with arguments: [ '/admin/moderators' ]

Number of calls: 0


Ignored nodes: comments, script, style
<html>
  <head />
