[Killed] StringLiteral
src/main/pages/HomePage.jsx:30:18
         queryKey: ["meals", d.code, selectedDate],
         queryFn: () =>
           axios
-            .get(`/api/diningcommons/${selectedDate}/${d.code}`)
+            .get(``)
             .then((res) => res.data),
       });
killedBy: HomePage meals offered today tests Renders correctly with mealsOfferedToday
statusReason: expect(element).toHaveTextContent()

Expected element to have text content:
  Breakfast
Received:
  No meals offered today

Ignored nodes: comments, script, style

[Killed] LogicalOperator
src/main/pages/HomePage.jsx:40:28
   const combined = Array.isArray(data)
     ? data.map((d, i) => ({
         ...d,
-        mealsOfferedToday: mealsOffered[i]?.data ?? [],
+        mealsOfferedToday: mealsOffered[i]?.data && [],
       }))
     : // Stryker disable next-line all : default empty array when dining data is missing
killedBy: HomePage meals offered today tests Renders correctly with mealsOfferedToday
statusReason: expect(element).toHaveTextContent()

Expected element to have text content:
  Breakfast
Received:
  No meals offered today

Ignored nodes: comments, script, style
