[Killed] ObjectLiteral
src/main/pages/ProfilePage.jsx:45:23
   const { user } = root;
   const { email, pictureUrl, fullName } = user;
 
-  const profileUser = {
-    ...user,
-    admin: hasRole(currentUser, "ROLE_ADMIN"),
-    moderator: hasRole(currentUser, "ROLE_MODERATOR"),
-  };
+  const profileUser = {};
 
   const onSubmit = async (data) => {
killedBy: ProfilePage tests displays initial alias correctly
statusReason: Unable to find an element with the text: NewAlias. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div>
    <div
      class="d-flex flex-column min-vh-100"
    >
