[Killed] BlockStatement
main/pages/Admin/ModeratorsIndexPage.jsx:20:30
     [],
   );
 
-  const createButton = () => {
-    return (
-      <Button
-        variant="primary"
-        as={Link}
-        to="/admin/moderators/create"
-        style={{ float: "right" }}
-      >
-        New Moderator
-      </Button>
-    );
-  };
+  const createButton = () => {};
 
   return (
killedBy: ModeratorsIndexPage tests Renders with New Moderator Button
statusReason: Unable to find an element with the text: /New Moderator/. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div>
    <div
      class="d-flex flex-column min-vh-100"
    >
