[Killed] LogicalOperator
main/components/Modal/ReviewModeratorModal.jsx:10:9
 
   const handleSubmit = (e) => {
     e.preventDefault();
-    if (status === "APPROVED" || status === "REJECTED") {
+    if (status === "APPROVED" && status === "REJECTED") {
       onSubmit({ status, moderatorComment });
     }
killedBy: ReviewsTable tests handleSubmit sends correct payload for approve; ReviewModeratorModal tests calls onSubmit with status APPROVED and moderatorComment
statusReason: expected +0 to be 1 // Object.is equality

Ignored nodes: comments, script, style
<html>
  <head />
  <body
    class=""
    style=""
