[Killed] ArrowFunction
main/pages/Admin/ModeratorsCreatePage.jsx:9:31
 
 export default function ModeratorsCreatePage({ storybook = false }) {
   const navigation = useNavigate();
-  const objectToAxiosParams = (moderator) => ({
-    url: "/api/admin/moderators/post",
-    method: "POST",
-    params: {
-      email: moderator.email,
-    },
-  });
+  const objectToAxiosParams = () => undefined;
 
   const onSuccess = (moderator) => {
killedBy: ModeratorsCreatePage tests on submit, makes request to backend, and redirects to /admin/moderators
statusReason: expected +0 to be 1 // Object.is equality

Ignored nodes: comments, script, style
<html>
  <head />
  <body>
    <div>
      <div

[Killed] BlockStatement
main/pages/Admin/ModeratorsCreatePage.jsx:17:36
     },
   });
 
-  const onSuccess = (moderator) => {
-    toast(`New moderator added - email: ${moderator.email}`);
-    if (!storybook) navigation("/admin/moderators");
-  };
+  const onSuccess = (moderator) => {};
 
   const mutation = useBackendMutation(
killedBy: ModeratorsCreatePage tests on submit, makes request to backend, and redirects to /admin/moderators
statusReason: expected "vi.fn()" to be called with arguments: [ Array(1) ]

Number of calls: 0
