[Killed] BlockStatement
main/components/Reviews/ReviewsTable.jsx:67:36
     setShow(true);
   };
 
-  const rejectCallback = (cell) => {
-    setPendingCell(cell);
-    setPendingStatus("REJECTED");
-    setShow(true);
-  };
+  const rejectCallback = (cell) => {};
 
   const handleSubmit = ({ moderatorComment }) => {
killedBy: ReviewsTable tests clicking Reject opens modal with REJECTED status
statusReason: Unable to find an element by: [data-testid="review-moderator-modal"]

Ignored nodes: comments, script, style
<body>
  <div>
    <div>
      <table
        class="table table-striped table-bordered table-hover"
