[Killed] BlockStatement
main/components/Users/RoleEmailTable.jsx:15:61
   testIdPrefix = "RoleEmailTable",
   customDeleteCallback = null, // optional deleteCallback, used in AdminsIndexPage
 }) {
-  const cellToAxiosParamsDelete = (cell, deleteEndpoint) => {
-    return {
-      url: deleteEndpoint,
-      method: "DELETE",
-      params: {
-        email: cell.row.original.email,
-      },
-    };
-  };
+  const cellToAxiosParamsDelete = (cell, deleteEndpoint) => {};
 
   const onDeleteSuccess = (message) => {
killedBy: AdminsIndexPage tests what happens when you click delete; RoleEmailTable Check defaults for api endpoints; ModeratorsIndexPage tests what happens when you click delete
statusReason: expected "vi.fn()" to be called with arguments: [ 'first moderator deleted' ]

Received: 

  1st vi.fn() call:

  [
-   "first moderator deleted",
