[Killed] BlockStatement
main/pages/Admin/AdminsIndexPage.jsx:20:30
     [],
   );
 
-  const createButton = () => {
-    return (
-      <Button
-        variant="primary"
-        as={Link}
-        to="/admin/admins/create"
-        style={{ float: "right" }}
-      >
-        New Admin
-      </Button>
-    );
-  };
+  const createButton = () => {};
 
   return (
killedBy: AdminsIndexPage tests Renders with New Admin Button
statusReason: Unable to find an element with the text: /New Admin/. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div>
    <div
      class="d-flex flex-column min-vh-100"
    >

[Killed] StringLiteral
main/pages/Admin/AdminsIndexPage.jsx:26:25
         variant="primary"
         as={Link}
         to="/admin/admins/create"
-        style={{ float: "right" }}
+        style={{ float: "" }}
       >
         New Admin
killedBy: AdminsIndexPage tests Renders with New Admin Button
statusReason: expect(element).toHaveAttribute("style", "float: right;") // element.getAttribute("style") === "float: right;"

Expected the element to have attribute:
  style="float: right;"
Received:
  null
