[Killed] ArrowFunction
main/components/Users/UsersTable.jsx:38:15
   {
     Header: "Admin",
     id: "admin",
-    accessor: (row, _rowIndex) => String(row.admin),
+    accessor: () => undefined,
   },
   {
killedBy: UserTable tests Has the expected column headers and content
statusReason: expect(element).toHaveTextContent()

Expected element to have text content:
  true
Received:

[Killed] BlockStatement
main/components/Users/UsersTable.jsx:55:24
   },
   {
     Header: "Status",
-    accessor: (row) => {
-      if (row.status === "Approved" && row.dateApproved) {
-        const [year, month, day] = row.dateApproved.split("-");
-        const formattedDate = new Date(
-          year,
-          month - 1,
-          day,
-        ).toLocaleDateString();
-        return `Approved on ${formattedDate}`;
-      }
-      return row.status;
-    },
+    accessor: (row) => {},
   },
 ];
killedBy: UserTable tests Status column appends approval date only for approved users with a valid date
statusReason: Unable to find an element with the text: Approved on 10/31/2024. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div>
    <table
      class="table table-striped table-bordered table-hover"
      role="table"

[Killed] ArrayDeclaration
main/components/Users/UsersTable.jsx:95:22
     toggleModeratorMutation.mutate(cell);
   };
 
-  const allColumns = [
-    ...columns,
-    ButtonColumn("Toggle Admin", "primary", toggleAdminCallback, "UsersTable"),
-    ButtonColumn(
-      "Toggle Moderator",
-      "primary",
-      toggleModeratorCallback,
-      "UsersTable",
-    ),
-  ];
+  const allColumns = [];
 
   return <OurTable data={users} columns={allColumns} testid={"UsersTable"} />;
killedBy: UserTable tests Has the expected column headers and content
statusReason: Unable to find an element with the text: id. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div>
    <table
      class="table table-striped table-bordered table-hover"
      role="table"
