[Killed] StringLiteral
main/pages/Admin/ModeratorsCreatePage.jsx:10:10
 export default function ModeratorsCreatePage({ storybook = false }) {
   const navigation = useNavigate();
   const objectToAxiosParams = (moderator) => ({
-    url: "/api/admin/moderators/post",
+    url: "",
     method: "POST",
     params: {
killedBy: ModeratorsCreatePage tests on submit, makes request to backend, and redirects to /admin/moderators
statusReason: expected "vi.fn()" to be called with arguments: [ Array(1) ]

Received: 

  1st vi.fn() call:

  [
-   "New moderator added - email: testemailone@ucsb.edu",

[Killed] ConditionalExpression
main/pages/Admin/ModeratorsCreatePage.jsx:19:9
 
   const onSuccess = (moderator) => {
     toast(`New moderator added - email: ${moderator.email}`);
-    if (!storybook) navigation("/admin/moderators");
+    if (true) navigation("/admin/moderators");
   };
 
killedBy: ModeratorsCreatePage tests on storybook, no redirect
statusReason: expected "vi.fn()" to not be called with arguments: [ '/admin/moderators' ]

Received: 

  1st vi.fn() call:

Compared values have no visual difference.

[Killed] StringLiteral
main/pages/Admin/ModeratorsCreatePage.jsx:25:6
   const mutation = useBackendMutation(
     objectToAxiosParams,
     { onSuccess },
-    ["/api/admin/moderators/get"], // mutation makes this key stale so that pages relying on it reload
+    [""], // mutation makes this key stale so that pages relying on it reload
   );
 
killedBy: ModeratorsCreatePage tests useBackendMutation is called with correct cache query key
statusReason: expected "useBackendMutation" to be called with arguments: [ Any<Function>, …(2) ]

Received: 

  1st useBackendMutation call:

  [
-   Any<Function>,
