[Killed] StringLiteral
main/components/Users/RoleEmailTable.jsx:10:20
 
 export default function RoleEmailTable({
   data,
-  deleteEndpoint = "/api/admin/delete",
+  deleteEndpoint = "",
   getEndpoint = "/api/admin/all",
   testIdPrefix = "RoleEmailTable",
killedBy: RoleEmailTable Check defaults for api endpoints
statusReason: expected '' to be '/api/admin/delete' // Object.is equality

[Killed] ConditionalExpression
main/components/Users/RoleEmailTable.jsx:49:13
       Header: "Delete",
       accessor: "isInAdminEmails",
       Cell: ({ cell }) => {
-        if (!cell.row.original.isInAdminEmails) {
+        if (false) {
           return (
             <Button
killedBy: ModeratorsIndexPage tests renders three items correctly; AdminsIndexPage tests renders three items correctly; RoleEmailTable renders table with email data
statusReason: Unable to find an element by: [data-testid="ModeratorsIndexPage-cell-row-0-col-delete-button"]

Ignored nodes: comments, script, style
<body>
  <div>
    <div
      class="d-flex flex-column min-vh-100"
    >
