[Killed] ObjectLiteral
main/pages/Admin/ModeratorsIndexPage.jsx:26:16
         variant="primary"
         as={Link}
         to="/admin/moderators/create"
-        style={{ float: "right" }}
+        style={{}}
       >
         New Moderator
killedBy: ModeratorsIndexPage tests Renders with New Moderator Button
statusReason: expect(element).toHaveAttribute("style", "float: right;") // element.getAttribute("style") === "float: right;"

Expected the element to have attribute:
  style="float: right;"
Received:
  null
