[Killed] StringLiteral
main/pages/Reviews/EditReviewPage.jsx:21:15
 
   const mutation = useBackendMutation(
     (updatedReview) => ({
-      method: "PUT",
+      method: "",
       url: `/api/reviews/reviewer`,
       params: { id },
killedBy: EditReviewPage tests submits updated review and navigates to /myreviews
statusReason: expected +0 to be 1 // Object.is equality

Ignored nodes: comments, script, style
<html>
  <head />
  <body>
    <div>
      <div

[Killed] BlockStatement
main/pages/Reviews/EditReviewPage.jsx:31:24
       },
     }),
     {
-      onSuccess: () => {
-        toast("Review updated!");
-        navigate("/myreviews");
-      },
+      onSuccess: () => {},
     },
     // Stryker disable next-line ArrayDeclaration,StringLiteral
killedBy: EditReviewPage tests submits updated review and navigates to /myreviews
statusReason: Unable to find an element with the text: Review updated!. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div>
    <div
      class="d-flex flex-column min-vh-100"
    >
