[Survived] OptionalChaining
main/components/MyReviews/ReviewForm.jsx:20:9
       comments: initialContents?.reviewerComments ?? "",
       stars: initialContents?.itemStars ?? 5,
       dateServed:
-        initialContents?.dateItemServed?.slice(0, 16) ??
+        initialContents?.dateItemServed.slice(0, 16) ??
         new Date().toISOString().slice(0, 16),
     },

[Killed] MethodExpression
main/components/MyReviews/ReviewForm.jsx:21:9
       stars: initialContents?.itemStars ?? 5,
       dateServed:
         initialContents?.dateItemServed?.slice(0, 16) ??
-        new Date().toISOString().slice(0, 16),
+        new Date().toISOString(),
     },
   });
killedBy: MyReviewsCreatePage - full coverage tests renders form fields with expected defaults
statusReason: expected '' not to be '' // Object.is equality
