[Killed] ArithmeticOperator
src/main/pages/AdminUsersPage.jsx:21:23
     {
       method: "GET",
       url: `/api/admin/users`,
-      params: { page: currentPage - 1, size: 50, sort: "id" },
+      params: { page: currentPage + 1, size: 50, sort: "id" },
     },
     {
killedBy: AdminUsersPage tests fetches users from correct API endpoint
statusReason: expected { page: 2, size: 50, sort: 'id' } to deeply equal { page: +0, size: 50, sort: 'id' }
