[Killed] ArithmeticOperator
main/components/Common/OurPagination.jsx:15:30
     updateActivePage(newPage);
   };
   const prevPage = () => {
-    const newPage = Math.max(currentActivePage - 1, 1);
+    const newPage = Math.max(currentActivePage + 1, 1);
     updateActivePage(newPage);
   };
killedBy: OurPagination tests navigation: prev button works correctly
statusReason: Unable to find an element by: [data-testid="OurPagination-4"]

Ignored nodes: comments, script, style
<body>
  <div>
    <ul
      class="pagination"
    >

[Killed] MethodExpression
main/components/Common/OurPagination.jsx:15:21
     updateActivePage(newPage);
   };
   const prevPage = () => {
-    const newPage = Math.max(currentActivePage - 1, 1);
+    const newPage = Math.min(currentActivePage - 1, 1);
     updateActivePage(newPage);
   };
killedBy: OurPagination tests navigation: prev button works correctly
statusReason: Unable to find an element with the text: (current). This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<a
  class="page-link"
  data-testid="OurPagination-4"
  href="#"
  role="button"

[Killed] BlockStatement
main/components/Common/OurPagination.jsx:33:47
     </Pagination.Item>
   );
 
-  const generateSimplePaginationItems = () => {
-    return Array.from({ length: totalPages }, (_, index) =>
-      pageButton(index + 1),
-    );
-  };
+  const generateSimplePaginationItems = () => {};
 
   const generateComplexPaginationItems = () => {
killedBy: OurPagination tests renders correctly for totalPages = 5 (less than or equal to 7)
statusReason: expected 2 to be 7 // Object.is equality
