[Killed] ArithmeticOperator
main/components/Common/OurPagination.jsx:11:30
   testId = "OurPagination",
 }) => {
   const nextPage = () => {
-    const newPage = Math.min(currentActivePage + 1, totalPages);
+    const newPage = Math.min(currentActivePage - 1, totalPages);
     updateActivePage(newPage);
   };
killedBy: OurPagination tests renders correctly for totalPages = 12, activePage = 8 (middle range, next clicks)
statusReason: Unable to find an element by: [data-testid="OurPagination-left-ellipsis"]

Ignored nodes: comments, script, style
<body>
  <div>
    <ul
      class="pagination"
    >

[Killed] BlockStatement
main/components/Common/OurPagination.jsx:14:26
     const newPage = Math.min(currentActivePage + 1, totalPages);
     updateActivePage(newPage);
   };
-  const prevPage = () => {
-    const newPage = Math.max(currentActivePage - 1, 1);
-    updateActivePage(newPage);
-  };
+  const prevPage = () => {};
   const thisPage = (page) => {
     updateActivePage(page);
killedBy: OurPagination tests navigation: prev button works correctly
statusReason: Unable to find an element with the text: (current). This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<a
  class="page-link"
  data-testid="OurPagination-4"
  href="#"
  role="button"

[Killed] ArrowFunction
main/components/Common/OurPagination.jsx:22:22
     updateActivePage(page);
   };
 
-  const pageButton = (number) => (
-    <Pagination.Item
-      key={number}
-      active={number === currentActivePage}
-      onClick={() => thisPage(number)}
-      data-testid={`${testId}-${number}`}
-    >
-      {number}
-    </Pagination.Item>
-  );
+  const pageButton = () => undefined;
 
   const generateSimplePaginationItems = () => {
killedBy: OurPagination tests renders correctly for totalPages = 5 (less than or equal to 7)
statusReason: expected 2 to be 7 // Object.is equality

[Killed] ArithmeticOperator
main/components/Common/OurPagination.jsx:35:18
 
   const generateSimplePaginationItems = () => {
     return Array.from({ length: totalPages }, (_, index) =>
-      pageButton(index + 1),
+      pageButton(index - 1),
     );
   };
killedBy: OurPagination tests renders correctly for totalPages = 5 (less than or equal to 7)
statusReason: expected <span class="page-link" …(1)>…(1)</span> to be <a class="page-link" …(4)></a> // Object.is equality

[Killed] EqualityOperator
main/components/Common/OurPagination.jsx:44:9
     const paginationItems = [pageButton(1)];
 
     // Case 1: currentActivePage is near the beginning (1, 2, 3, 4)
-    if (currentActivePage < 5) {
+    if (currentActivePage >= 5) {
       paginationItems.push(pageButton(2));
       paginationItems.push(pageButton(3));
killedBy: OurPagination tests renders correctly when we take the default of 10)
statusReason: Found multiple elements by: [data-testid="OurPagination-1"]

Here are the matching elements:

Ignored nodes: comments, script, style
<span
  class="page-link"
  data-testid="OurPagination-1"

[Killed] ConditionalExpression
main/components/Common/OurPagination.jsx:44:9
     const paginationItems = [pageButton(1)];
 
     // Case 1: currentActivePage is near the beginning (1, 2, 3, 4)
-    if (currentActivePage < 5) {
+    if (true) {
       paginationItems.push(pageButton(2));
       paginationItems.push(pageButton(3));
killedBy: OurPagination tests renders correctly for totalPages = 12, activePage = 5 (middle range)
statusReason: Unable to find an element by: [data-testid="OurPagination-left-ellipsis"]

Ignored nodes: comments, script, style
<body>
  <div>
    <ul
      class="pagination"
    >

[Killed] ArithmeticOperator
main/components/Common/OurPagination.jsx:57:34
       );
     }
     // Case 2: currentActivePage is near the end (totalPages - 3, totalPages - 2, totalPages - 1, totalPages)
-    else if (currentActivePage > totalPages - 4) {
+    else if (currentActivePage > totalPages + 4) {
       paginationItems.push(
         <Pagination.Ellipsis
killedBy: OurPagination tests renders correctly for totalPages = 12, activePage = 9 (near end)
statusReason: expected 10 to be 9 // Object.is equality

[Killed] EqualityOperator
main/components/Common/OurPagination.jsx:57:14
       );
     }
     // Case 2: currentActivePage is near the end (totalPages - 3, totalPages - 2, totalPages - 1, totalPages)
-    else if (currentActivePage > totalPages - 4) {
+    else if (currentActivePage >= totalPages - 4) {
       paginationItems.push(
         <Pagination.Ellipsis
killedBy: OurPagination tests renders correctly for totalPages = 12, activePage = 8 (middle range, next clicks)
statusReason: Unable to find an element by: [data-testid="OurPagination-7"]

Ignored nodes: comments, script, style
<body>
  <div>
    <ul
      class="pagination"
    >

[Killed] EqualityOperator
main/components/Common/OurPagination.jsx:93:5
   };
 
   const generatePaginationItems = () =>
-    totalPages <= 7
+    totalPages < 7
       ? generateSimplePaginationItems()
       : generateComplexPaginationItems();
killedBy: OurPagination tests renders correctly for totalPages = 7 (less than or equal to 7)
statusReason: Unable to find an element by: [data-testid="OurPagination-6"]

Ignored nodes: comments, script, style
<body>
  <div>
    <ul
      class="pagination"
    >
