[Killed] StringLiteral
main/components/AliasApproval/AliasApprovalTable.jsx:21:41
 
   if (moderatorOptions) {
     columns.push(ButtonColumn("Approve", "primary", approveCallback, testid));
-    columns.push(ButtonColumn("Reject", "danger", rejectCallback, testid));
+    columns.push(ButtonColumn("Reject", "", rejectCallback, testid));
   }
 
killedBy: AliasApprovalTable tests buttons appear and work properly
statusReason: expect(element).toHaveClass("btn-danger")

Expected the element to have class:
  btn-danger
Received:
  btn

[Killed] ConditionalExpression
main/components/AliasApproval/AliasApprovalTable.jsx:26:38
 
   return (
     <OurTable
-      data={aliases.filter((user) => user.status === "AWAITING_REVIEW")}
+      data={aliases.filter((user) => true)}
       columns={columns}
       testid={testid}
killedBy: AliasApprovalTable tests only renders users with AWAITING_REVIEW status
statusReason: expect(element).not.toBeInTheDocument()

expected document not to contain element, found <td
  data-testid="Aliasapprovaltable-cell-row-1-col-proposedAlias"
  role="cell"
>
  test
</td> instead
