[Killed] BlockStatement
main/components/Common/OurPagination.jsx:10:26
   totalPages = 10,
   testId = "OurPagination",
 }) => {
-  const nextPage = () => {
-    const newPage = Math.min(currentActivePage + 1, totalPages);
-    updateActivePage(newPage);
-  };
+  const nextPage = () => {};
   const prevPage = () => {
     const newPage = Math.max(currentActivePage - 1, 1);
killedBy: OurPagination tests renders correctly for totalPages = 12, activePage = 8 (middle range, next clicks)
statusReason: Unable to find an element by: [data-testid="OurPagination-left-ellipsis"]

Ignored nodes: comments, script, style
<body>
  <div>
    <ul
      class="pagination"
    >

[Killed] MethodExpression
main/components/Common/OurPagination.jsx:11:21
   testId = "OurPagination",
 }) => {
   const nextPage = () => {
-    const newPage = Math.min(currentActivePage + 1, totalPages);
+    const newPage = Math.max(currentActivePage + 1, totalPages);
     updateActivePage(newPage);
   };
killedBy: OurPagination tests renders correctly for totalPages = 12, activePage = 8 (middle range, next clicks)
statusReason: Unable to find an element by: [data-testid="OurPagination-4"]

Ignored nodes: comments, script, style
<body>
  <div>
    <ul
      class="pagination"
    >

[Killed] EqualityOperator
main/components/Common/OurPagination.jsx:25:15
   const pageButton = (number) => (
     <Pagination.Item
       key={number}
-      active={number === currentActivePage}
+      active={number !== currentActivePage}
       onClick={() => thisPage(number)}
       data-testid={`${testId}-${number}`}
killedBy: OurPagination tests navigation: prev button works correctly
statusReason: Unable to find an element with the text: (current). This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<a
  class="page-link"
  data-testid="OurPagination-5"
  href="#"
  role="button"

[Killed] ConditionalExpression
main/components/Common/OurPagination.jsx:25:15
   const pageButton = (number) => (
     <Pagination.Item
       key={number}
-      active={number === currentActivePage}
+      active={false}
       onClick={() => thisPage(number)}
       data-testid={`${testId}-${number}`}
killedBy: OurPagination tests navigation: prev button works correctly
statusReason: Unable to find an element with the text: (current). This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<a
  class="page-link"
  data-testid="OurPagination-5"
  href="#"
  role="button"

[Killed] ArrowFunction
main/components/Common/OurPagination.jsx:26:16
     <Pagination.Item
       key={number}
       active={number === currentActivePage}
-      onClick={() => thisPage(number)}
+      onClick={() => undefined}
       data-testid={`${testId}-${number}`}
     >
killedBy: AdminUsersPage tests pagination changes backend page correctly; OurPagination tests navigation: prev button works correctly
statusReason: expect(element).toHaveTextContent()

Expected element to have text content:
  2
Received:
  1

Ignored nodes: comments, script, style

[Killed] BlockStatement
main/components/Common/OurPagination.jsx:44:32
     const paginationItems = [pageButton(1)];
 
     // Case 1: currentActivePage is near the beginning (1, 2, 3, 4)
-    if (currentActivePage < 5) {
-      paginationItems.push(pageButton(2));
-      paginationItems.push(pageButton(3));
-      paginationItems.push(pageButton(4));
-      paginationItems.push(pageButton(5));
-      paginationItems.push(
-        <Pagination.Ellipsis
-          key="right-ellipsis"
-          data-testid={`${testId}-right-ellipsis`}
-        />,
-      );
-    }
+    if (currentActivePage < 5) {}
     // Case 2: currentActivePage is near the end (totalPages - 3, totalPages - 2, totalPages - 1, totalPages)
     else if (currentActivePage > totalPages - 4) {
killedBy: OurPagination tests renders correctly when we take the default of 10)
statusReason: expected 4 to be 9 // Object.is equality

[Killed] EqualityOperator
main/components/Common/OurPagination.jsx:44:9
     const paginationItems = [pageButton(1)];
 
     // Case 1: currentActivePage is near the beginning (1, 2, 3, 4)
-    if (currentActivePage < 5) {
+    if (currentActivePage <= 5) {
       paginationItems.push(pageButton(2));
       paginationItems.push(pageButton(3));
killedBy: OurPagination tests renders correctly for totalPages = 12, activePage = 5 (middle range)
statusReason: Unable to find an element by: [data-testid="OurPagination-left-ellipsis"]

Ignored nodes: comments, script, style
<body>
  <div>
    <ul
      class="pagination"
    >

[Killed] EqualityOperator
main/components/Common/OurPagination.jsx:57:14
       );
     }
     // Case 2: currentActivePage is near the end (totalPages - 3, totalPages - 2, totalPages - 1, totalPages)
-    else if (currentActivePage > totalPages - 4) {
+    else if (currentActivePage <= totalPages - 4) {
       paginationItems.push(
         <Pagination.Ellipsis
killedBy: OurPagination tests renders correctly for totalPages = 12, activePage = 5 (middle range)
statusReason: Unable to find an element by: [data-testid="OurPagination-5"]

Ignored nodes: comments, script, style
<body>
  <div>
    <ul
      class="pagination"
    >

[Killed] ConditionalExpression
main/components/Common/OurPagination.jsx:57:14
       );
     }
     // Case 2: currentActivePage is near the end (totalPages - 3, totalPages - 2, totalPages - 1, totalPages)
-    else if (currentActivePage > totalPages - 4) {
+    else if (false) {
       paginationItems.push(
         <Pagination.Ellipsis
killedBy: OurPagination tests renders correctly for totalPages = 12, activePage = 9 (near end)
statusReason: expected 10 to be 9 // Object.is equality

[Killed] ArithmeticOperator
main/components/Common/OurPagination.jsx:64:39
           data-testid={`${testId}-left-ellipsis`}
         />,
       );
-      paginationItems.push(pageButton(totalPages - 4));
+      paginationItems.push(pageButton(totalPages + 4));
       paginationItems.push(pageButton(totalPages - 3));
       paginationItems.push(pageButton(totalPages - 2));
killedBy: OurPagination tests renders correctly for totalPages = 12, activePage = 9 (near end)
statusReason: Unable to find an element by: [data-testid="OurPagination-8"]

Ignored nodes: comments, script, style
<body>
  <div>
    <ul
      class="pagination"
    >

[Killed] BlockStatement
main/components/Common/OurPagination.jsx:70:10
       paginationItems.push(pageButton(totalPages - 1));
     }
     // Case 3: currentActivePage is in the middle
-    else {
-      paginationItems.push(
-        <Pagination.Ellipsis
-          key="left-ellipsis"
-          data-testid={`${testId}-left-ellipsis`}
-        />,
-      );
-      paginationItems.push(pageButton(currentActivePage - 1));
-      paginationItems.push(pageButton(currentActivePage));
-      paginationItems.push(pageButton(currentActivePage + 1));
-      paginationItems.push(
-        <Pagination.Ellipsis
-          key="right-ellipsis"
-          data-testid={`${testId}-right-ellipsis`}
-        />,
-      );
-    }
+    else {}
 
     paginationItems.push(pageButton(totalPages));
killedBy: OurPagination tests renders correctly for totalPages = 12, activePage = 5 (middle range)
statusReason: Unable to find an element by: [data-testid="OurPagination-5"]

Ignored nodes: comments, script, style
<body>
  <div>
    <ul
      class="pagination"
    >

[Killed] ArithmeticOperator
main/components/Common/OurPagination.jsx:79:39
       );
       paginationItems.push(pageButton(currentActivePage - 1));
       paginationItems.push(pageButton(currentActivePage));
-      paginationItems.push(pageButton(currentActivePage + 1));
+      paginationItems.push(pageButton(currentActivePage - 1));
       paginationItems.push(
         <Pagination.Ellipsis
killedBy: OurPagination tests renders correctly for totalPages = 12, activePage = 5 (middle range)
statusReason: Found multiple elements by: [data-testid="OurPagination-4"]

Here are the matching elements:

Ignored nodes: comments, script, style
<a
  class="page-link"
  data-testid="OurPagination-4"
