[Killed] ObjectLiteral
main/components/DiningCommons/DiningCommonsTable.jsx:19:5
       Header: "Name",
       accessor: "name",
     },
-    {
-      Header: "Meals Offered Today",
-      accessor: "mealsOfferedToday",
-      Cell: ({ value, row }) => {
-        return (
-          <div>
-            {!value || value.length === 0
-              ? "No meals offered today"
-              : value.map((meal) => (
-                  <Link
-                    key={meal.code}
-                    to={`/diningcommons/${date}/${row.original.code}/${meal.code}`}
-                    className="p-2"
-                    data-testid={`DiningCommonsTable-cell-row-${row.index}-col-meal-${meal.code}`}
-                  >
-                    {meal.name}
-                  </Link>
-                ))}
-          </div>
-        );
-      },
-    },
+    {},
     {
       Header: "Has Dining Cam",
killedBy: DiningCommonsTable tests Checkmark / X for Boolean columns shows up as expected, url shows up correctly
statusReason: A column ID (or string accessor) is required!

[Killed] ConditionalExpression
main/components/DiningCommons/DiningCommonsTable.jsx:25:14
       Cell: ({ value, row }) => {
         return (
           <div>
-            {!value || value.length === 0
+            {false
               ? "No meals offered today"
               : value.map((meal) => (
killedBy: DiningCommonsTable tests Checkmark / X for Boolean columns shows up as expected, url shows up correctly
statusReason: Cannot read properties of undefined (reading 'map')
