[Killed] BlockStatement
main/components/MenuItem/MenuItemTable.jsx:18:47
     navigate(`/reviews/${itemId}`);
   };
 
-  const calculateAverageRating = (reviews) => {
-    if (!reviews || !Array.isArray(reviews) || reviews.length === 0)
-      return "No reviews";
-    const validRatings = reviews
-      .filter(
-        (r) => r && typeof r === "object" && typeof r.itemsStars === "number",
-      )
-      .map((r) => r.itemsStars);
-    if (validRatings.length === 0) return "No ratings";
-    const avg = validRatings.reduce((a, b) => a + b, 0) / validRatings.length;
-    return avg.toFixed(1);
-  };
+  const calculateAverageRating = (reviews) => {};
 
   const columns = [
killedBy: MenuItemTable Tests Renders 5 Menu Items Correctly with ratings
statusReason: expect(element).toHaveTextContent()

Expected element to have text content:
  4.5
Received:

[Killed] LogicalOperator
main/components/MenuItem/MenuItemTable.jsx:19:9
   };
 
   const calculateAverageRating = (reviews) => {
-    if (!reviews || !Array.isArray(reviews) || reviews.length === 0)
+    if (!reviews && !Array.isArray(reviews) || reviews.length === 0)
       return "No reviews";
     const validRatings = reviews
killedBy: MenuItemTable Tests returns 'No reviews' when reviews is not an array
statusReason: reviews.filter is not a function

[Killed] LogicalOperator
main/components/MenuItem/MenuItemTable.jsx:23:16
       return "No reviews";
     const validRatings = reviews
       .filter(
-        (r) => r && typeof r === "object" && typeof r.itemsStars === "number",
+        (r) => r || typeof r === "object" && typeof r.itemsStars === "number",
       )
       .map((r) => r.itemsStars);
killedBy: MenuItemTable Tests calculateAverageRating handles edge cases correctly
statusReason: Cannot read properties of null (reading 'itemsStars')

[Killed] LogicalOperator
main/components/MenuItem/MenuItemTable.jsx:23:16
       return "No reviews";
     const validRatings = reviews
       .filter(
-        (r) => r && typeof r === "object" && typeof r.itemsStars === "number",
+        (r) => r && typeof r === "object" || typeof r.itemsStars === "number",
       )
       .map((r) => r.itemsStars);
killedBy: MenuItemTable Tests calculateAverageRating handles edge cases correctly
statusReason: Cannot read properties of null (reading 'itemsStars')

[Killed] ArrowFunction
main/components/MenuItem/MenuItemTable.jsx:25:12
       .filter(
         (r) => r && typeof r === "object" && typeof r.itemsStars === "number",
       )
-      .map((r) => r.itemsStars);
+      .map(() => undefined);
     if (validRatings.length === 0) return "No ratings";
     const avg = validRatings.reduce((a, b) => a + b, 0) / validRatings.length;
killedBy: MenuItemTable Tests Renders 5 Menu Items Correctly with ratings
statusReason: expect(element).toHaveTextContent()

Expected element to have text content:
  4.5
Received:
  NaN

[Killed] EqualityOperator
main/components/MenuItem/MenuItemTable.jsx:26:9
         (r) => r && typeof r === "object" && typeof r.itemsStars === "number",
       )
       .map((r) => r.itemsStars);
-    if (validRatings.length === 0) return "No ratings";
+    if (validRatings.length !== 0) return "No ratings";
     const avg = validRatings.reduce((a, b) => a + b, 0) / validRatings.length;
     return avg.toFixed(1);
killedBy: MenuItemTable Tests Renders 5 Menu Items Correctly with ratings
statusReason: expect(element).toHaveTextContent()

Expected element to have text content:
  4.5
Received:
  No ratings
