[Killed] BlockStatement
main/components/Modal/ReviewModeratorModal.jsx:8:31
   // Stryker disable next-line StringLiteral
   const [moderatorComment, setModeratorComment] = useState("");
 
-  const handleSubmit = (e) => {
-    e.preventDefault();
-    if (status === "APPROVED" || status === "REJECTED") {
-      onSubmit({ status, moderatorComment });
-    }
-    // Stryker disable next-line StringLiteral
-    setModeratorComment("");
-    onClose();
-  };
+  const handleSubmit = (e) => {};
 
   const handleClose = () => {
killedBy: ReviewsTable tests handleSubmit sends correct payload for approve; ReviewModeratorModal tests calls onSubmit with status APPROVED and moderatorComment
statusReason: expected +0 to be 1 // Object.is equality

Ignored nodes: comments, script, style
<html>
  <head />
  <body
    class="modal-open"
    data-rr-ui-modal-open=""

[Killed] ConditionalExpression
main/components/Modal/ReviewModeratorModal.jsx:10:34
 
   const handleSubmit = (e) => {
     e.preventDefault();
-    if (status === "APPROVED" || status === "REJECTED") {
+    if (status === "APPROVED" || false) {
       onSubmit({ status, moderatorComment });
     }
killedBy: ReviewsTable tests handleSubmit sends correct payload for reject; ReviewModeratorModal tests calls onSubmit with status REJECTED and moderatorComment
statusReason: expected +0 to be 1 // Object.is equality

Ignored nodes: comments, script, style
<html>
  <head />
  <body
    class=""
    style=""

[Killed] ConditionalExpression
main/components/Modal/ReviewModeratorModal.jsx:10:9
 
   const handleSubmit = (e) => {
     e.preventDefault();
-    if (status === "APPROVED" || status === "REJECTED") {
+    if (true) {
       onSubmit({ status, moderatorComment });
     }
killedBy: ReviewModeratorModal tests does not call onSubmit when status is PENDING
statusReason: expected "vi.fn()" to not be called at all, but actually been called 1 times

Received: 

  1st vi.fn() call:

    Array [
      Object {

[Killed] EqualityOperator
main/components/Modal/ReviewModeratorModal.jsx:24:22
     onClose();
   };
 
-  const isApproved = status === "APPROVED";
+  const isApproved = status !== "APPROVED";
 
   return (
killedBy: ReviewsTable tests clicking Approve opens modal with APPROVED status; ReviewModeratorModal tests submit button says Approve when status is APPROVED
statusReason: expect(element).toHaveTextContent()

Expected element to have text content:
  Approve
Received:
  Reject

[Killed] ConditionalExpression
main/components/Modal/ReviewModeratorModal.jsx:24:22
     onClose();
   };
 
-  const isApproved = status === "APPROVED";
+  const isApproved = true;
 
   return (
killedBy: ReviewsTable tests clicking Reject opens modal with REJECTED status; ReviewModeratorModal tests submit button says Reject when status is REJECTED
statusReason: expect(element).toHaveTextContent()

Expected element to have text content:
  Reject
Received:
  Approve
