[Killed] ObjectLiteral
main/components/MyReviews/ReviewForm.jsx:15:15
     register,
     handleSubmit,
     formState: { errors },
-  } = useForm({
-    defaultValues: {
-      comments: initialContents?.reviewerComments ?? "",
-      stars: initialContents?.itemStars ?? 5,
-      dateServed:
-        initialContents?.dateItemServed?.slice(0, 16) ??
-        new Date().toISOString().slice(0, 16),
-    },
-  });
+  } = useForm({});
 
   const onSubmit = (data) => {
killedBy: MyReviewsCreatePage - full coverage tests renders form fields with expected defaults; EditReviewPage tests renders form pre-populated with existing review data
statusReason: expect(element).toHaveValue(5)

Expected the element to have value:
  5
Received:
  1

[Killed] ObjectLiteral
main/components/MyReviews/ReviewForm.jsx:16:20
     handleSubmit,
     formState: { errors },
   } = useForm({
-    defaultValues: {
-      comments: initialContents?.reviewerComments ?? "",
-      stars: initialContents?.itemStars ?? 5,
-      dateServed:
-        initialContents?.dateItemServed?.slice(0, 16) ??
-        new Date().toISOString().slice(0, 16),
-    },
+    defaultValues: {},
   });
 
killedBy: MyReviewsCreatePage - full coverage tests renders form fields with expected defaults; EditReviewPage tests renders form pre-populated with existing review data
statusReason: expect(element).toHaveValue(5)

Expected the element to have value:
  5
Received:
  1

[Killed] OptionalChaining
main/components/MyReviews/ReviewForm.jsx:17:17
     formState: { errors },
   } = useForm({
     defaultValues: {
-      comments: initialContents?.reviewerComments ?? "",
+      comments: initialContents.reviewerComments ?? "",
       stars: initialContents?.itemStars ?? 5,
       dateServed:
killedBy: MyReviewsCreatePage - full coverage tests renders form fields with expected defaults; MyReviewsCreatePage handles missing query params renders default view
statusReason: Cannot read properties of undefined (reading 'reviewerComments')

[Killed] LogicalOperator
main/components/MyReviews/ReviewForm.jsx:17:17
     formState: { errors },
   } = useForm({
     defaultValues: {
-      comments: initialContents?.reviewerComments ?? "",
+      comments: initialContents?.reviewerComments && "",
       stars: initialContents?.itemStars ?? 5,
       dateServed:
killedBy: EditReviewPage tests renders form pre-populated with existing review data
statusReason: expect(element).toHaveValue(Very good)

Expected the element to have value:
  Very good
Received:

[Killed] LogicalOperator
main/components/MyReviews/ReviewForm.jsx:18:14
   } = useForm({
     defaultValues: {
       comments: initialContents?.reviewerComments ?? "",
-      stars: initialContents?.itemStars ?? 5,
+      stars: initialContents?.itemStars && 5,
       dateServed:
         initialContents?.dateItemServed?.slice(0, 16) ??
killedBy: EditReviewPage tests renders form pre-populated with existing review data; MyReviewsCreatePage - full coverage tests renders form fields with expected defaults
statusReason: expect(element).toHaveValue(4)

Expected the element to have value:
  4
Received:
  5

[Killed] MethodExpression
main/components/MyReviews/ReviewForm.jsx:20:9
       comments: initialContents?.reviewerComments ?? "",
       stars: initialContents?.itemStars ?? 5,
       dateServed:
-        initialContents?.dateItemServed?.slice(0, 16) ??
+        initialContents?.dateItemServed ??
         new Date().toISOString().slice(0, 16),
     },
killedBy: EditReviewPage tests date field is pre-populated with sliced date
statusReason: expect(element).toHaveValue(2024-04-01T12:00)

Expected the element to have value:
  2024-04-01T12:00
Received:

[Killed] LogicalOperator
main/components/MyReviews/ReviewForm.jsx:20:9
       comments: initialContents?.reviewerComments ?? "",
       stars: initialContents?.itemStars ?? 5,
       dateServed:
-        initialContents?.dateItemServed?.slice(0, 16) ??
-        new Date().toISOString().slice(0, 16),
+        initialContents?.dateItemServed?.slice(0, 16) && new Date().toISOString().slice(0, 16),
     },
   });
killedBy: MyReviewsCreatePage - full coverage tests renders form fields with expected defaults
statusReason: expected '' not to be '' // Object.is equality

[Killed] BooleanLiteral
main/components/MyReviews/ReviewForm.jsx:67:28
           id="review-stars"
           isInvalid={Boolean(errors.stars)}
           {...register("stars", {
-            valueAsNumber: true,
+            valueAsNumber: false,
           })}
         >
killedBy: MyReviewsCreatePage - full coverage tests submits form and navigates on successful post
statusReason: expected { itemId: undefined, …(3) } to deeply equal { itemId: undefined, …(3) }

[Killed] OptionalChaining
main/components/MyReviews/ReviewForm.jsx:89:12
           {...register("dateServed", { required: "Date is required" })}
         />
         <Form.Control.Feedback type="invalid">
-          {errors.dateServed?.message}
+          {errors.dateServed.message}
         </Form.Control.Feedback>
       </Form.Group>
killedBy: MyReviewsCreatePage - full coverage tests renders form fields with expected defaults; MyReviewsCreatePage handles missing query params renders default view
statusReason: Cannot read properties of undefined (reading 'message')
