[Killed] BooleanLiteral
main/components/Reviews/ReviewsTable.jsx:20:36
 }) {
   const navigate = useNavigate();
 
-  const [show, setShow] = useState(false);
+  const [show, setShow] = useState(true);
   const [pendingCell, setPendingCell] = useState(null);
   const [pendingStatus, setPendingStatus] = useState(null);
killedBy: ReviewsTable tests modal is not visible on initial render
statusReason: expect(element).not.toBeInTheDocument()

expected document not to contain element, found <div
  class="modal-dialog"
  data-testid="review-moderator-modal"
>
  <div
    class="modal-content"

[Killed] BlockStatement
main/components/Reviews/ReviewsTable.jsx:24:29
   const [pendingCell, setPendingCell] = useState(null);
   const [pendingStatus, setPendingStatus] = useState(null);
 
-  const handleClose = () => {
-    setShow(false);
-    setPendingCell(null);
-    setPendingStatus(null);
-  };
+  const handleClose = () => {};
 
   const editCallback = (cell) => {
killedBy: ReviewsTable tests cancel button closes the modal
statusReason: expect(element).not.toBeInTheDocument()

expected document not to contain element, found <div
  class="modal-dialog"
  data-testid="review-moderator-modal"
>
  <div
    class="modal-content"

[Killed] BooleanLiteral
main/components/Reviews/ReviewsTable.jsx:25:13
   const [pendingStatus, setPendingStatus] = useState(null);
 
   const handleClose = () => {
-    setShow(false);
+    setShow(true);
     setPendingCell(null);
     setPendingStatus(null);
killedBy: ReviewsTable tests cancel button closes the modal
statusReason: expect(element).not.toBeInTheDocument()

expected document not to contain element, found <div
  class="modal-dialog"
  data-testid="review-moderator-modal"
>
  <div
    class="modal-content"

[Killed] BlockStatement
main/components/Reviews/ReviewsTable.jsx:61:37
     deleteMutation.mutate(cell);
   };
 
-  const approveCallback = (cell) => {
-    setPendingCell(cell);
-    setPendingStatus("APPROVED");
-    setShow(true);
-  };
+  const approveCallback = (cell) => {};
 
   const rejectCallback = (cell) => {
killedBy: ReviewsTable tests clicking Approve opens modal with APPROVED status
statusReason: Unable to find an element by: [data-testid="review-moderator-modal"]

Ignored nodes: comments, script, style
<body
  class=""
  style=""
>
  <div>

[Killed] BooleanLiteral
main/components/Reviews/ReviewsTable.jsx:64:13
   const approveCallback = (cell) => {
     setPendingCell(cell);
     setPendingStatus("APPROVED");
-    setShow(true);
+    setShow(false);
   };
 
killedBy: ReviewsTable tests clicking Approve opens modal with APPROVED status
statusReason: Unable to find an element by: [data-testid="review-moderator-modal"]

Ignored nodes: comments, script, style
<body
  class=""
  style=""
>
  <div>

[Killed] StringLiteral
main/components/Reviews/ReviewsTable.jsx:69:22
 
   const rejectCallback = (cell) => {
     setPendingCell(cell);
-    setPendingStatus("REJECTED");
+    setPendingStatus("");
     setShow(true);
   };
killedBy: ReviewsTable tests handleSubmit sends correct payload for reject
statusReason: expected +0 to be 1 // Object.is equality

Ignored nodes: comments, script, style
<html>
  <head />
  <body
    class=""
    style=""

[Killed] BooleanLiteral
main/components/Reviews/ReviewsTable.jsx:70:13
   const rejectCallback = (cell) => {
     setPendingCell(cell);
     setPendingStatus("REJECTED");
-    setShow(true);
+    setShow(false);
   };
 
killedBy: ReviewsTable tests clicking Reject opens modal with REJECTED status
statusReason: Unable to find an element by: [data-testid="review-moderator-modal"]

Ignored nodes: comments, script, style
<body
  class=""
  style=""
>
  <div>

[Killed] ConditionalExpression
main/components/Reviews/ReviewsTable.jsx:74:9
   };
 
   const handleSubmit = ({ moderatorComment }) => {
-    if (pendingStatus === "APPROVED") {
+    if (false) {
       approveMutation.mutate({
         cell: pendingCell,
killedBy: ReviewsTable tests handleSubmit sends correct payload for approve
statusReason: expected { id: 1, status: 'REJECTED', …(1) } to match object { status: 'APPROVED', …(1) }
(1 matching property omitted from actual)

Ignored nodes: comments, script, style
<html>
  <head />
  <body
    class=""

[Killed] ObjectLiteral
main/components/Reviews/ReviewsTable.jsx:89:5
   };
 
   const columns = [
-    {
-      Header: "Moderation Status",
-      accessor: "status",
-      Cell: ({ value }) => value,
-    },
+    {},
     {
       Header: "Moderator Comment",
killedBy: ModerateReviews Page Tests renders reviews with approve/reject buttons for moderator
statusReason: A column ID (or string accessor) is required!

[Killed] StringLiteral
main/components/Reviews/ReviewsTable.jsx:90:15
 
   const columns = [
     {
-      Header: "Moderation Status",
+      Header: "",
       accessor: "status",
       Cell: ({ value }) => value,
killedBy: ReviewsTable tests Has the base column headers and content
statusReason: Unable to find an element with the text: Moderation Status. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div>
    <div>
      <table
        class="table table-striped table-bordered table-hover"

[Killed] ArrowFunction
main/components/Reviews/ReviewsTable.jsx:92:13
     {
       Header: "Moderation Status",
       accessor: "status",
-      Cell: ({ value }) => value,
+      Cell: () => undefined,
     },
     {
killedBy: ReviewsTable tests Has the base column headers and content
statusReason: expect(element).toHaveTextContent()

Expected element to have text content:
  AWAITING_REVIEW
Received:

[Killed] ArrowFunction
main/components/Reviews/ReviewsTable.jsx:97:13
     {
       Header: "Moderator Comment",
       accessor: "moderatorComments",
-      Cell: ({ value }) => value,
+      Cell: () => undefined,
     },
     {
killedBy: ReviewsTable tests moderatorComments cell renders the value correctly
statusReason: expect(element).toHaveTextContent()

Expected element to have text content:
  Inappropriate content
Received:

[Killed] StringLiteral
main/components/Reviews/ReviewsTable.jsx:101:17
     },
     {
       Header: "Item Id",
-      accessor: "item.id",
+      accessor: "",
     },
     {
killedBy: ReviewsTable tests Has the base column headers and content; ModerateReviews Page Tests renders reviews with approve/reject buttons for moderator; ReviewsPage tests renders table when backend is available
statusReason: Unable to find an element by: [data-testid="Reviewstable-cell-row-0-col-item.id"]

Ignored nodes: comments, script, style
<body>
  <div>
    <div>
      <table
        class="table table-striped table-bordered table-hover"

[Killed] ObjectLiteral
main/components/Reviews/ReviewsTable.jsx:107:5
       Header: "Item Name",
       accessor: "item.name",
     },
-    {
-      Header: "Score",
-      accessor: "itemsStars",
-      Cell: ({ value }) => "⭐".repeat(value),
-    },
+    {},
     {
       Header: "Comments",
killedBy: ReviewsTable tests Has the base column headers and content; MyReviewsIndexPage tests renders three reviews correctly for regular user
statusReason: A column ID (or string accessor) is required!

[Killed] StringLiteral
main/components/Reviews/ReviewsTable.jsx:125:17
     },
     {
       Header: "Dining Commons Code",
-      accessor: "item.diningCommonsCode",
+      accessor: "",
     },
   ];
killedBy: ReviewsTable tests Has the base column headers and content
statusReason: Unable to find an element by: [data-testid="Reviewstable-cell-row-0-col-item.diningCommonsCode"]

Ignored nodes: comments, script, style
<body>
  <div>
    <div>
      <table
        class="table table-striped table-bordered table-hover"

[Killed] StringLiteral
main/components/Reviews/ReviewsTable.jsx:142:20
       ButtonColumn("Approve", "primary", approveCallback, "Reviewstable"),
     );
     columns.push(
-      ButtonColumn("Reject", "danger", rejectCallback, "Reviewstable"),
+      ButtonColumn("", "danger", rejectCallback, "Reviewstable"),
     );
   }
killedBy: ModerateReviews Page Tests renders reviews with approve/reject buttons for moderator
statusReason: Unable to find an element by: [data-testid="Reviewstable-cell-row-0-col-item.id"]

Ignored nodes: comments, script, style
<body>
  <div />
</body>

Ignored nodes: comments, script, style
