[Killed] ConditionalExpression
main/components/Users/RoleEmailForm.jsx:37:12
           })}
         />
         <Form.Control.Feedback type="invalid">
-          {errors.email && "A valid email is required."}
+          {true}
         </Form.Control.Feedback>
       </Form.Group>
killedBy: RoleEmailForm tests that the correct validations are performed
statusReason: Unable to find an element with the text: /A valid email is required./. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div>
    <form
      class=""
    >
