[Killed] StringLiteral
main/components/Users/RoleEmailTable.jsx:12:18
   data,
   deleteEndpoint = "/api/admin/delete",
   getEndpoint = "/api/admin/all",
-  testIdPrefix = "RoleEmailTable",
+  testIdPrefix = "",
   customDeleteCallback = null, // optional deleteCallback, used in AdminsIndexPage
 }) {
killedBy: RoleEmailTable renders table with email data plus isInAdminEmails
statusReason: Unable to find an element by: [data-testid="RoleEmailTable-header-isInAdminEmails"]

Ignored nodes: comments, script, style
<body>
  <div>
    <table
      class="table table-striped table-bordered table-hover"
      role="table"

[Killed] BlockStatement
main/components/Users/RoleEmailTable.jsx:34:49
     { onSuccess: onDeleteSuccess },
     [getEndpoint],
   );
-  const defaultDeleteCallback = async (cell) => {
-    deleteMutation.mutate(cell);
-  };
+  const defaultDeleteCallback = async (cell) => {};
 
   const deleteCallback = customDeleteCallback || defaultDeleteCallback;
killedBy: AdminsIndexPage tests what happens when you click delete; ModeratorsIndexPage tests what happens when you click delete; RoleEmailTable Check defaults for api endpoints
statusReason: expected "vi.fn()" to be called with arguments: [ 'first moderator deleted' ]

Number of calls: 0


Ignored nodes: comments, script, style
<html>
  <head />

[Killed] ConditionalExpression
main/components/Users/RoleEmailTable.jsx:38:26
     deleteMutation.mutate(cell);
   };
 
-  const deleteCallback = customDeleteCallback || defaultDeleteCallback;
+  const deleteCallback = true;
 
   const columns = [
killedBy: RoleEmailTable calls deleteCallback when Delete button clicked; ModeratorsIndexPage tests what happens when you click delete; AdminsIndexPage tests what happens when you click delete
statusReason: expected "vi.fn()" to be called 1 times, but got 0 times

[Killed] LogicalOperator
main/components/Users/RoleEmailTable.jsx:38:26
     deleteMutation.mutate(cell);
   };
 
-  const deleteCallback = customDeleteCallback || defaultDeleteCallback;
+  const deleteCallback = customDeleteCallback && defaultDeleteCallback;
 
   const columns = [
killedBy: RoleEmailTable calls deleteCallback when Delete button clicked
statusReason: expected "vi.fn()" to be called 1 times, but got 0 times

[Killed] ObjectLiteral
main/components/Users/RoleEmailTable.jsx:41:5
   const deleteCallback = customDeleteCallback || defaultDeleteCallback;
 
   const columns = [
-    {
-      Header: "Email",
-      accessor: "email", // accessor is the "key" in the data
-    },
+    {},
     {
       Header: "Delete",
killedBy: AdminsIndexPage tests Renders with New Admin Button
statusReason: A column ID (or string accessor) is required!

[Killed] StringLiteral
main/components/Users/RoleEmailTable.jsx:43:17
   const columns = [
     {
       Header: "Email",
-      accessor: "email", // accessor is the "key" in the data
+      accessor: "", // accessor is the "key" in the data
     },
     {
killedBy: ModeratorsIndexPage tests renders three items correctly; AdminsIndexPage tests renders three items correctly; RoleEmailTable renders table with email data
statusReason: Unable to find an element by: [data-testid="ModeratorsIndexPage-cell-row-0-col-email"]

Ignored nodes: comments, script, style
<body>
  <div>
    <div
      class="d-flex flex-column min-vh-100"
    >

[Killed] BlockStatement
main/components/Users/RoleEmailTable.jsx:48:27
     {
       Header: "Delete",
       accessor: "isInAdminEmails",
-      Cell: ({ cell }) => {
-        if (!cell.row.original.isInAdminEmails) {
-          return (
-            <Button
-              variant="danger"
-              onClick={() => deleteCallback(cell)}
-              data-testid={`${testIdPrefix}-cell-row-${cell.row.index}-col-delete-button`}
-            >
-              Delete
-            </Button>
-          );
-        }
-        return (
-          <span
-            data-testid={`${testIdPrefix}-cell-row-${cell.row.index}-cannot-delete`}
-          >
-            In <code>ADMIN_EMAILS</code>
-          </span>
-        );
-      },
+      Cell: ({ cell }) => {},
     },
   ];
killedBy: ModeratorsIndexPage tests renders three items correctly; RoleEmailTable renders table with email data; AdminsIndexPage tests renders three items correctly
statusReason: Unable to find an element by: [data-testid="ModeratorsIndexPage-cell-row-0-col-delete-button"]

Ignored nodes: comments, script, style
<body>
  <div>
    <div
      class="d-flex flex-column min-vh-100"
    >

[Killed] BooleanLiteral
main/components/Users/RoleEmailTable.jsx:49:13
       Header: "Delete",
       accessor: "isInAdminEmails",
       Cell: ({ cell }) => {
-        if (!cell.row.original.isInAdminEmails) {
+        if (cell.row.original.isInAdminEmails) {
           return (
             <Button
killedBy: AdminsIndexPage tests renders three items correctly; RoleEmailTable renders table with email data
statusReason: Unable to find an element by: [data-testid="AdminsIndexPage-cell-row-0-col-delete-button"]

Ignored nodes: comments, script, style
<body>
  <div>
    <div
      class="d-flex flex-column min-vh-100"
    >

[Killed] BlockStatement
main/components/Users/RoleEmailTable.jsx:49:49
       Header: "Delete",
       accessor: "isInAdminEmails",
       Cell: ({ cell }) => {
-        if (!cell.row.original.isInAdminEmails) {
-          return (
-            <Button
-              variant="danger"
-              onClick={() => deleteCallback(cell)}
-              data-testid={`${testIdPrefix}-cell-row-${cell.row.index}-col-delete-button`}
-            >
-              Delete
-            </Button>
-          );
-        }
+        if (!cell.row.original.isInAdminEmails) {}
         return (
           <span
killedBy: AdminsIndexPage tests renders three items correctly; ModeratorsIndexPage tests renders three items correctly; RoleEmailTable renders table with email data
statusReason: Unable to find an element by: [data-testid="AdminsIndexPage-cell-row-0-col-delete-button"]

Ignored nodes: comments, script, style
<body>
  <div>
    <div
      class="d-flex flex-column min-vh-100"
    >

[Killed] ArrowFunction
main/components/Users/RoleEmailTable.jsx:53:24
           return (
             <Button
               variant="danger"
-              onClick={() => deleteCallback(cell)}
+              onClick={() => undefined}
               data-testid={`${testIdPrefix}-cell-row-${cell.row.index}-col-delete-button`}
             >
killedBy: ModeratorsIndexPage tests what happens when you click delete; RoleEmailTable calls deleteCallback when Delete button clicked; AdminsIndexPage tests what happens when you click delete
statusReason: expected "vi.fn()" to be called with arguments: [ 'first moderator deleted' ]

Received: 

  1st vi.fn() call:

  [
-   "first moderator deleted",
