[Killed] ObjectLiteral
main/components/Users/UsersTable.jsx:16:3
     Header: "Last Name",
     accessor: "familyName",
   },
-  {
-    Header: "Email",
-    accessor: "email",
-  },
+  {},
   {
     Header: "Admin",
killedBy: UserTable tests renders without crashing for empty table
statusReason: A column ID (or string accessor) is required!

[Killed] ObjectLiteral
main/components/Users/UsersTable.jsx:30:3
     id: "moderator",
     accessor: (row, _rowIndex) => String(row.moderator),
   },
-  {
-    Header: "Alias",
-    accessor: "alias",
-  },
+  {},
   {
     Header: "Proposed Alias",
killedBy: UserTable tests renders without crashing for empty table
statusReason: A column ID (or string accessor) is required!

[Killed] BlockStatement
main/components/Users/UsersTable.jsx:40:24
   },
   {
     Header: "Status",
-    accessor: (row) => {
-      if (row.status === "Approved" && row.dateApproved) {
-        // Parse as local date (YYYY-MM-DD)
-        const [year, month, day] = row.dateApproved.split("-");
-        const formattedDate = new Date(
-          year,
-          month - 1,
-          day,
-        ).toLocaleDateString();
-        return `Approved on ${formattedDate}`;
-      }
-      return row.status;
-    },
+    accessor: (row) => {},
   },
 ];
killedBy: UserTable tests Status column appends approval date only for approved users with a valid date
statusReason: Unable to find an element with the text: Approved on 10/31/2024. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div>
    <table
      class="table table-striped table-bordered table-hover"
      role="table"

[Killed] ConditionalExpression
main/components/Users/UsersTable.jsx:41:11
   {
     Header: "Status",
     accessor: (row) => {
-      if (row.status === "Approved" && row.dateApproved) {
+      if (false) {
         // Parse as local date (YYYY-MM-DD)
         const [year, month, day] = row.dateApproved.split("-");
killedBy: UserTable tests Status column appends approval date only for approved users with a valid date
statusReason: Unable to find an element with the text: Approved on 10/31/2024. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div>
    <table
      class="table table-striped table-bordered table-hover"
      role="table"

[Killed] BlockStatement
main/components/Users/UsersTable.jsx:41:58
   {
     Header: "Status",
     accessor: (row) => {
-      if (row.status === "Approved" && row.dateApproved) {
-        // Parse as local date (YYYY-MM-DD)
-        const [year, month, day] = row.dateApproved.split("-");
-        const formattedDate = new Date(
-          year,
-          month - 1,
-          day,
-        ).toLocaleDateString();
-        return `Approved on ${formattedDate}`;
-      }
+      if (row.status === "Approved" && row.dateApproved) {}
       return row.status;
     },
killedBy: UserTable tests Status column appends approval date only for approved users with a valid date
statusReason: Unable to find an element with the text: Approved on 10/31/2024. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div>
    <table
      class="table table-striped table-bordered table-hover"
      role="table"
