[Killed] ObjectLiteral
src/main/pages/AdminUsersPage.jsx:18:5
   } = useBackend(
     // Stryker disable next-line all : don't test internal caching of React Query
     [`/api/admin/users/${currentPage - 1}`],
-    {
-      method: "GET",
-      url: `/api/admin/users`,
-      params: { page: currentPage - 1, size: 50, sort: "id" },
-    },
+    {},
     {
       content: [],
killedBy: AdminUsersPage tests renders empty table when backend unavailable
statusReason: expected 'Error communicating with backend via …' to match 'Error communicating with backend via …'
