[Killed] ConditionalExpression
src/main/pages/HomePage.jsx:24:7
     setSelectedDate(newDate);
   };
   const queries = [];
-  if (Array.isArray(data)) {
+  if (false) {
     for (const d of data) {
       queries.push({
killedBy: HomePage meals offered today tests Query key must be 'meals'
statusReason: expected 0 to be greater than 0
