[Killed] ConditionalExpression
main/pages/Meal/MealTimesPage.jsx:29:7
     navigate(`/diningcommons/${newDate}/${diningCommonsCode}`);
   };
 
-  if (status === 204) {
+  if (false) {
     const message = `${diningCommonsCode} is closed on ${dateTime}. Please select another date or dining common.`;
     toast(message, { toastId: "closed-dining-commons" });
killedBy: MealTimesPage tests when backend returns 204, displays toast message
statusReason: expected "vi.fn()" to be called with arguments: [ …(2) ]

Number of calls: 0


Ignored nodes: comments, script, style
<html>
  <head />

[Killed] ConditionalExpression
main/pages/Meal/MealTimesPage.jsx:69:10
             onChange={onChangeDate}
           />
         </p>
-        {meals && (
-          <MealTable
-            meals={meals}
-            dateTime={dateTime}
-            diningCommonsCode={diningCommonsCode}
-          />
-        )}
+        {false}
       </div>
     </BasicLayout>
killedBy: MealTimesPage tests displays correct information in the table
statusReason: Unable to find an element with the text: Breakfast. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div>
    <div
      class="d-flex flex-column min-vh-100"
    >

[Killed] ConditionalExpression
main/pages/Meal/MealTimesPage.jsx:69:10
             onChange={onChangeDate}
           />
         </p>
-        {meals && (
-          <MealTable
-            meals={meals}
-            dateTime={dateTime}
-            diningCommonsCode={diningCommonsCode}
-          />
-        )}
+        {true}
       </div>
     </BasicLayout>
killedBy: MealTimesPage tests displays correct information in the table
statusReason: Unable to find an element with the text: Breakfast. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div>
    <div
      class="d-flex flex-column min-vh-100"
    >
