[Killed] ObjectLiteral
src/main/pages/ModerateAliasesPage.jsx:33:5
   const approveMutation = useBackendMutation(
     cellToAxiosParamsApprove,
     // On success: invalidate both relevant query keys
-    { onSuccess: onModerateSuccess },
+    {},
     // Stryker disable next-line all : don't test internal caching of React Query
     ["/api/admin/usersWithProposedAlias"],
killedBy: ModerateAliases Page Tests approve button calls mutation and shows success for correct data
statusReason: expected "vi.fn()" to be called with arguments: [ 'Moderation success' ]

Number of calls: 0


Ignored nodes: comments, script, style
<html>
  <head />

[Killed] LogicalOperator
src/main/pages/ModerateAliasesPage.jsx:60:5
   };
 
   const moderateAliasesOptions =
-    hasRole(currentUser, "ROLE_ADMIN") ||
-    hasRole(currentUser, "ROLE_MODERATOR");
+    hasRole(currentUser, "ROLE_ADMIN") && hasRole(currentUser, "ROLE_MODERATOR");
 
   return (
killedBy: ModerateAliases Page Tests renders aliases with approve/reject buttons for moderators
statusReason: Unable to find an element by: [data-testid="Aliasapprovaltable-cell-row-0-col-Approve-button"]

Ignored nodes: comments, script, style
<body>
  <div>
    <div
      class="d-flex flex-column min-vh-100"
    >

[Killed] ConditionalExpression
src/main/pages/ModerateAliasesPage.jsx:60:5
   };
 
   const moderateAliasesOptions =
-    hasRole(currentUser, "ROLE_ADMIN") ||
-    hasRole(currentUser, "ROLE_MODERATOR");
+    false;
 
   return (
killedBy: ModerateAliases Page Tests renders aliases with approve/reject buttons for moderators
statusReason: Unable to find an element by: [data-testid="Aliasapprovaltable-cell-row-0-col-Approve-button"]

Ignored nodes: comments, script, style
<body>
  <div>
    <div
      class="d-flex flex-column min-vh-100"
    >
