[Killed] ConditionalExpression
src/main/pages/ModerateReviewsPage.jsx:23:5
   );
 
   const moderateReviewsOptions =
-    hasRole(currentUser, "ROLE_ADMIN") ||
-    hasRole(currentUser, "ROLE_MODERATOR");
+    true;
 
   return (
killedBy: ModerateReviews Page Tests does NOT render approve/reject buttons for regular user
statusReason: expect(element).not.toBeInTheDocument()

expected document not to contain element, found <button
  class="btn btn-primary"
  data-testid="Reviewstable-cell-row-0-col-Approve-button"
  type="button"
>
  Approve
