[Killed] StringLiteral
src/main/pages/ProfilePage.jsx:20:13
 
   const objectToAxiosParams = (user) => ({
     url: "/api/currentUser/updateAlias",
-    method: "POST",
+    method: "",
     params: {
       proposedAlias: user.proposedAlias,
killedBy: ProfilePage tests handles alias submission successfully and sends correct params
statusReason: expected "vi.fn()" to be called with arguments: [ Array(1) ]

Received: 

  1st vi.fn() call:

  [
-   "Alias Awaiting Moderation: NewPropAlias",

[Killed] BlockStatement
src/main/pages/ProfilePage.jsx:26:31
     },
   });
 
-  const onSuccess = (user) => {
-    toast(`Alias Awaiting Moderation: ${user.proposedAlias}`);
-  };
+  const onSuccess = (user) => {};
 
   const mutation = useBackendMutation(
killedBy: ProfilePage tests handles alias submission successfully and sends correct params
statusReason: expected "vi.fn()" to be called with arguments: [ Array(1) ]

Number of calls: 0


Ignored nodes: comments, script, style
<html>
  <head />

[Killed] StringLiteral
src/main/pages/ProfilePage.jsx:48:37
   const profileUser = {
     ...user,
     admin: hasRole(currentUser, "ROLE_ADMIN"),
-    moderator: hasRole(currentUser, "ROLE_MODERATOR"),
+    moderator: hasRole(currentUser, ""),
   };
 
killedBy: ProfilePage tests renders correctly for moderator user
statusReason: expect(element).toHaveTextContent()

Expected element to have text content:
  true
Received:
  false
