[Killed] ObjectLiteral
main/pages/Reviews/EditReviewPage.jsx:16:5
     // Stryker disable next-line ArrayDeclaration,StringLiteral
     [`/api/reviews/${id}`],
     // Stryker disable next-line StringLiteral
-    { method: "GET", url: `/api/reviews/${id}` },
+    {},
   );
 
killedBy: EditReviewPage tests renders form pre-populated with existing review data
statusReason: Unable to find a label with the text of: /comments/i

Ignored nodes: comments, script, style
<body>
  <div>
    <div
      class="d-flex flex-column min-vh-100"
    >

[Killed] ArrowFunction
main/pages/Reviews/EditReviewPage.jsx:20:5
   );
 
   const mutation = useBackendMutation(
-    (updatedReview) => ({
-      method: "PUT",
-      url: `/api/reviews/reviewer`,
-      params: { id },
-      data: {
-        reviewerComments: updatedReview.reviewerComments,
-        itemStars: updatedReview.itemsStars,
-        dateItemServed: updatedReview.dateItemServed,
-      },
-    }),
+    () => undefined,
     {
       onSuccess: () => {
killedBy: EditReviewPage tests submits updated review and navigates to /myreviews
statusReason: expected +0 to be 1 // Object.is equality

Ignored nodes: comments, script, style
<html>
  <head />
  <body>
    <div>
      <div

[Killed] ObjectLiteral
main/pages/Reviews/EditReviewPage.jsx:24:13
       method: "PUT",
       url: `/api/reviews/reviewer`,
       params: { id },
-      data: {
-        reviewerComments: updatedReview.reviewerComments,
-        itemStars: updatedReview.itemsStars,
-        dateItemServed: updatedReview.dateItemServed,
-      },
+      data: {},
     }),
     {
killedBy: EditReviewPage tests submits updated review and navigates to /myreviews
statusReason: expected {} to deeply equal { …(3) }

[Killed] ConditionalExpression
main/pages/Reviews/EditReviewPage.jsx:44:10
     <BasicLayout>
       <div className="pt-2">
         <h1>Edit Review</h1>
-        {review && (
-          <ReviewForm
-            initialContents={{
-              ...review,
-              itemStars: review.itemsStars,
-              itemName: review.item?.name,
-            }}
-            initialItemName={review.item?.name}
-            submitAction={(data) => mutation.mutate(data)}
-            buttonLabel="Update Review"
-          />
-        )}
+        {false}
       </div>
     </BasicLayout>
killedBy: EditReviewPage tests renders form pre-populated with existing review data
statusReason: Unable to find a label with the text of: /comments/i

Ignored nodes: comments, script, style
<body>
  <div>
    <div
      class="d-flex flex-column min-vh-100"
    >

[Killed] OptionalChaining
main/pages/Reviews/EditReviewPage.jsx:49:25
             initialContents={{
               ...review,
               itemStars: review.itemsStars,
-              itemName: review.item?.name,
+              itemName: review.item.name,
             }}
             initialItemName={review.item?.name}
killedBy: EditReviewPage tests handles review with no item gracefully
statusReason: Unable to find a label with the text of: /item name/i

Ignored nodes: comments, script, style
<body>
  <div />
</body>

Ignored nodes: comments, script, style

[Killed] ArrowFunction
main/pages/Reviews/EditReviewPage.jsx:52:27
               itemName: review.item?.name,
             }}
             initialItemName={review.item?.name}
-            submitAction={(data) => mutation.mutate(data)}
+            submitAction={() => undefined}
             buttonLabel="Update Review"
           />
killedBy: EditReviewPage tests submits updated review and navigates to /myreviews
statusReason: expected +0 to be 1 // Object.is equality

Ignored nodes: comments, script, style
<html>
  <head />
  <body>
    <div>
      <div
