[Killed] UnaryOperator
main/pages/Reviews/PostReviewPage.jsx:41:16
       });
       // Stryker disable next-line all : itemName will be defined
       toast(`Review submitted for ${itemName}`);
-      navigate(-1);
+      navigate(+1);
     } catch (err) {
       toast.error(
killedBy: MyReviewsCreatePage - full coverage tests submits form and navigates on successful post
statusReason: expected "vi.fn()" to be called with arguments: [ -1 ]

Received: 

  1st vi.fn() call:

  [
-   -1,

[Killed] ConditionalExpression
main/pages/Reviews/PostReviewPage.jsx:44:37
       navigate(-1);
     } catch (err) {
       toast.error(
-        `Error submitting review: ${err.response?.data?.error || err.message}`,
+        `Error submitting review: ${true}`,
       );
     }
killedBy: MyReviewsCreatePage - full coverage tests shows error toast on network error during post with fallback message
statusReason: Unable to find an element with the text: /Error submitting review: timeout of 0ms exceeded/i. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div>
    <div
      class="d-flex flex-column min-vh-100"
    >
