[Killed] ArrowFunction
src/main/utils/Aliases.jsx:3:41
 import { toast } from "react-toastify";
 
-export const cellToAxiosParamsApprove = (cell) => ({
-  method: "PUT",
-  url: "/api/currentUser/updateAliasModeration",
-  params: {
-    id: cell.row.original.id,
-    approved: true,
-    proposedAlias: cell.row.original.proposedAlias,
-  },
-});
+export const cellToAxiosParamsApprove = () => undefined;
 
 export const cellToAxiosParamsReject = (cell) => ({
killedBy: Aliases Utils cellToAxiosParamsApprove returns the correct params for APPROVED
statusReason: expected undefined to deeply equal { …(3) }

[Killed] ObjectLiteral
src/main/utils/Aliases.jsx:6:11
 export const cellToAxiosParamsApprove = (cell) => ({
   method: "PUT",
   url: "/api/currentUser/updateAliasModeration",
-  params: {
-    id: cell.row.original.id,
-    approved: true,
-    proposedAlias: cell.row.original.proposedAlias,
-  },
+  params: {},
 });
 
killedBy: Aliases Utils cellToAxiosParamsApprove returns the correct params for APPROVED
statusReason: expected { method: 'PUT', …(2) } to deeply equal { …(3) }
