[Killed] BlockStatement
src/main/utils/Reviews.jsx:18:76
   };
 }
 
-export function cellToAxiosParamsModerate(cell, status, moderatorComments) {
-  return {
-    url: "/api/reviews/moderate",
-    method: "PUT",
-    params: {
-      id: cell.row.original.id,
-      status: status,
-      moderatorComments: moderatorComments || "",
-    },
-  };
-}
+export function cellToAxiosParamsModerate(cell, status, moderatorComments) {}
 
 export function onModerateSuccess() {
killedBy: Reviews cellToAxiosParamsModerate It returns the correct params for APPROVED
statusReason: expected undefined to deeply equal { url: '/api/reviews/moderate', …(2) }

[Killed] ConditionalExpression
src/main/utils/Reviews.jsx:25:26
     params: {
       id: cell.row.original.id,
       status: status,
-      moderatorComments: moderatorComments || "",
+      moderatorComments: false,
     },
   };
killedBy: Reviews cellToAxiosParamsModerate It returns the correct params for APPROVED
statusReason: expected { url: '/api/reviews/moderate', …(2) } to deeply equal { url: '/api/reviews/moderate', …(2) }
