[Killed] ConditionalExpression
src/main/utils/useBackend.jsx:44:9
     },
     {
       initialData:
-        initialData !== undefined
+        false
           ? { data: initialData, status: 200 }
           : undefined,
killedBy: ModerateReviews Page Tests renders reviews with approve/reject buttons for moderator; ReviewsPage tests renders empty table when backend is unavailable
statusReason: Cannot read properties of undefined (reading 'forEach')
